# Toposolid Is Cut Void Stability Enabled Method

Source: https://www.revitapidocs.com/2026/edae798c-d914-2d4c-12d5-96cce8f06290.htm

---

| Toposolid Is Cut Void Stability Enabled Method |
| --- |

Identifies if the setting for stability of Boolean operations for Toposolid elements is enabled or disabled.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool IsCutVoidStabilityEnabled(
	Document document
)
```

```
Public Shared Function IsCutVoidStabilityEnabled (
	document As Document
) As Boolean
```

```
public:
static bool IsCutVoidStabilityEnabled(
	Document^ document
)
```

```
static member IsCutVoidStabilityEnabled :
        document : Document -> bool
```

#### Parameters

document Document
:   The document.

#### Return Value

Boolean
True means enable cut void stability setting, otherwise disable. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks The stability setting increases the chance of cut and void operation success by applying a random shift
 (a hyper\-random testing action where the computer shifts the cut\-void along the x or y axis, starting from the minimum distance).
 Enabling this may slightly impact the accuracy of the geometry.
 When used, the voided geometry is changed, and will be reported in a warning.
 Please note that success cannot be guaranteed for Boolean operations when this setting is enabled. See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace